FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
#include "ledLib.h"
#include "driver/gpio.h"
#include <inttypes.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "nvsLib.h"
#include "logLib.h"
#include <stdarg.h>
#include <esp_err.h>
#include "driver/ledc.h"
#include "screenLib.h"
#include "esp_timer.h"

#define USE_LVGL_SCREEN 0

#if USE_LVGL_SCREEN
#include "lcdLib.h"
#endif

#if CONFIG_DEBUG_GPIO || CONFIG_DEBUG_LEDC
#include "soc/soc_caps.h"
#endif

#if CONFIG_DEBUG_LEDC
#include "hal/ledc_types.h"
#include "soc/ledc_struct.h"
#include "soc/clk_tree_defs.h"
#include "esp_clk_tree.h"
#endif

#if CONFIG_DEBUG_GPIO
#include "hal/gpio_types.h"
#include "esp_private/esp_gpio_reserve.h"
#endif

#include "driver/rmt_tx.h"

//timer configs

//duty properties
#define GET_MAX_DUTY(res) ((1 << (res)) - 1)

#if CONFIG_USE_BTS7960
//for h-bridge bts7960
#define BTS_TIMER           LEDC_TIMER_0
#if CONFIG_IDF_TARGET_ESP32
#define BTS_SPEED_MODE      LEDC_HIGH_SPEED_MODE
#else
#define BTS_SPEED_MODE      LEDC_LOW_SPEED_MODE
#endif
#define BTS_GPIO_FWD        41
#define BTS_CHANNEL_FWD     LEDC_CHANNEL_0
#define BTS_GPIO_BWD        42
#define BTS_CHANNEL_BWD     LEDC_CHANNEL_1
#define BTS_FREQ            20000 //max frequency BTS : 25kHz
#define BTS_RESOLUTION      LEDC_TIMER_11_BIT

//bts7960
#define DEADZONE_MOTOR 5
#define MIN_MOTOR_DUTY_FWD 0
#define MAX_MOTOR_DUTY_FWD GET_MAX_DUTY(BTS_RESOLUTION) //max duty : 2^resolution - 1
#define MIN_MOTOR_DUTY_BWD 0
#define MAX_MOTOR_DUTY_BWD GET_MAX_DUTY(BTS_RESOLUTION)
#endif

#if CONFIG_USE_MG996R
//for servo mg996r
#define MG_TIMER            LEDC_TIMER_1
#if CONFIG_IDF_TARGET_ESP32
#define MG_SPEED_MODE       LEDC_HIGH_SPEED_MODE
#else
#define MG_SPEED_MODE       LEDC_LOW_SPEED_MODE
#endif
#define MG_GPIO             (7) //parentheses reliable to avoid bugs in calculus
#define MG_CHANNEL          LEDC_CHANNEL_2
#define MG_FREQ             50 //50 Hz for mg996r
#if CONFIG_IDF_TARGET_ESP32
#define MG_RESOLUTION       LEDC_TIMER_15_BIT
#else
#define MG_RESOLUTION       LEDC_TIMER_14_BIT
#endif

//mg996r
#if CONFIG_IDF_TARGET_ESP32
#define MIN_SERVO_DUTY 1638
#define MAX_SERVO_DUTY 3277
#else
#define MIN_SERVO_DUTY 819
#define MAX_SERVO_DUTY 1639
#endif
#endif


#define LEDC_TEST_FADE_TIME    (3000)


#if CONFIG_USE_KY006
//passive buzzer
#define BUZZER_GPIO 19
#define BUZZER_RESOLUTION LEDC_TIMER_13_BIT
#define BUZZER_START_FREQ 2000
#define BUZZER_MIN_DUTY 0
#define BUZZER_MAX_DUTY (GET_MAX_DUTY(BUZZER_RESOLUTION) / 2)
#define BUZZER_SPEED_MODE LEDC_LOW_SPEED_MODE
#define BUZZER_LEDC_TIMER LEDC_TIMER_2
#define BUZZER_LEDC_CHANNEL LEDC_CHANNEL_4
#endif

#if CONFIG_USE_KY029
#define KY029_RED_GPIO          18  // À adapter selon ton câblage
#define KY029_GREEN_GPIO        19   // À adapter selon ton câblage
#define KY029_RESOLUTION        LEDC_TIMER_13_BIT
#define KY029_FREQ              5000 // 5 kHz (parfait pour les LEDs, aucun scintillement)
#define KY029_MIN_DUTY          0
#define KY029_MAX_DUTY          GET_MAX_DUTY(KY029_RESOLUTION) // 100% de luminosité (pas divisé par 2 !)
#define KY029_SPEED_MODE        LEDC_LOW_SPEED_MODE
#define KY029_LEDC_TIMER        LEDC_TIMER_3  // Nouveau timer (car fréquence différente du buzzer)
#define KY029_RED_CHANNEL       LEDC_CHANNEL_5
#define KY029_GREEN_CHANNEL     LEDC_CHANNEL_6
#endif

#if CONFIG_USE_KY009
#define KY009_RED_GPIO          18  // À adapter selon ton câblage
#define KY009_GREEN_GPIO        19   // À adapter selon ton câblage
#define KY009_BLUE_GPIO         17  // À adapter selon ton câblage
#define KY009_RESOLUTION        LEDC_TIMER_13_BIT
#define KY009_FREQ              5000 // 5 kHz (parfait pour les LEDs, aucun scintillement)
#define KY009_MIN_DUTY          0
#define KY009_MAX_DUTY          GET_MAX_DUTY(KY009_RESOLUTION) // 100% de luminosité (pas divisé par 2 !)
#define KY009_SPEED_MODE        LEDC_LOW_SPEED_MODE
#define KY009_LEDC_TIMER        LEDC_TIMER_3  // Nouveau timer (car fréquence différente du buzzer)
#define KY009_RED_CHANNEL       LEDC_CHANNEL_5
#define KY009_GREEN_CHANNEL     LEDC_CHANNEL_6
#define KY009_BLUE_CHANNEL     LEDC_CHANNEL_7
#endif

#if CONFIG_USE_BUILTIN_LED
//LED pin gpio connected on breadboard
#define LED_PIN 2

#endif

static const char *TAG = "led_library";

#if CONFIG_USE_BUILTIN_LED_W2812B
#define LED_GPIO             48
#define RMT_CLK_RES_HZ       10000000 // Horloge à 10MHz -> 1 tick = 100ns

// Définition de nos timings en nombre de ticks
#define T0H  4   // 400ns à l'état HAUT
#define T0L  8   // 800ns à l'état BAS
#define T1H  8   // 800ns à l'état HAUT
#define T1L  4   // 400ns à l'état BAS

static rmt_channel_handle_t tx_chan = NULL;
static rmt_encoder_handle_t copy_encoder = NULL;

static void init_ws2812_rmt(void) {
    // 1. Configuration du canal matériel RMT TX
    rmt_tx_channel_config_t tx_chan_config = {
        .clk_src = RMT_CLK_SRC_DEFAULT,
        .gpio_num = LED_GPIO,
        .mem_block_symbols = 64,        // Buffer interne suffisant pour 1 LED (24 bits)
        .resolution_hz = RMT_CLK_RES_HZ,
        .trans_queue_depth = 4,
    };
    rmt_new_tx_channel(&tx_chan_config, &tx_chan);

    // 2. Initialisation de l'encodeur "Copy" d'ESP-IDF
    // Il va copier notre tableau de symboles directement vers la mémoire du RMT
    rmt_copy_encoder_config_t copy_encoder_config = {};
    rmt_new_copy_encoder(&copy_encoder_config, &copy_encoder);

    // 3. Activation du canal matériel
    rmt_enable(tx_chan);

    log_msg(TAG, "BUILTIN W2812B initialized");
}

#endif

void set_led_color(uint8_t r, uint8_t g, uint8_t b) {

#if CONFIG_USE_BUILTIN_LED_W2812B
    // ATTENTION : Le WS2812B attend les couleurs dans l'ordre G-R-B (Vert, Rouge, Bleu)
    // On fusionne les trois octets dans un seul entier 24 bits
    uint32_t color_val = ((uint32_t)g << 16) | ((uint32_t)r << 8) | b;

    // 1 LED = 24 bits = Il nous faut un tableau de 24 symboles RMT
    rmt_symbol_word_t led_symbols[24];

    // On boucle sur les 24 bits, du plus fort (MSB) au plus faible (LSB)
    for (int i = 0; i < 24; i++) {
        // Extraction du bit courant (0 ou 1)
        uint32_t bit = (color_val >> (23 - i)) & 0x01;

        if (bit == 0) {
            // Configuration de la vague pour un bit '0'
            led_symbols[i] = (rmt_symbol_word_t) {
                .duration0 = T0H, .level0 = 1, // Reste HAUT pendant T0H ticks
                .duration1 = T0L, .level1 = 0  // Puis passe BAS pendant T0L ticks
            };
        } else {
            // Configuration de la vague pour un bit '1'
            led_symbols[i] = (rmt_symbol_word_t) {
                .duration0 = T1H, .level0 = 1, // Reste HAUT pendant T1H ticks
                .duration1 = T1L, .level1 = 0  // Puis passe BAS pendant T1L ticks
            };
        }
    }

    // Configuration de la transmission
    rmt_transmit_config_t transmit_config = {
        .loop_count = 0, // On envoie une seule fois
    };

    // Transmission des données (la taille demandée doit être en octets !)
    rmt_transmit(tx_chan, copy_encoder, led_symbols, sizeof(led_symbols), &transmit_config);
    
    // Attente synchrone que le RMT ait fini de cracher les bits sur la pin
    rmt_tx_wait_all_done(tx_chan, portMAX_DELAY);

    log_msg(TAG, "W2812B color set to: %u,%u,%u [RGB]", r, g, b);
#endif
}

#if CONFIG_USE_MG996R
//global variables
static uint8_t current_angle = 0;
#endif

#if CONFIG_USE_BTS7960
static volatile int16_t current_motor = 0;
static volatile int16_t target_motor = 0;
#endif

static int led_state = 0; //TODO : convert to uint8
//mutex for changes to global variables
static SemaphoreHandle_t xMutex = NULL;

#if CONFIG_USE_BTS7960
/*
* Prepare and set configuration of timers
* that will be used by LED Controller
*/
static ledc_timer_config_t ledc_timer_bts = {
    .duty_resolution = BTS_RESOLUTION, // resolution of PWM duty : 0..8191
    .freq_hz = BTS_FREQ,                      // frequency of PWM signal : 20ms
    .speed_mode = BTS_SPEED_MODE,           // timer mode
    .timer_num = BTS_TIMER,            // timer index
    .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
};
#endif
#if CONFIG_USE_MG996R
static ledc_timer_config_t ledc_timer_mg = {
    .duty_resolution = MG_RESOLUTION, // resolution of PWM duty : 0..8191
    .freq_hz = MG_FREQ,                      // frequency of PWM signal : 20ms
    .speed_mode = MG_SPEED_MODE,           // timer mode
    .timer_num = MG_TIMER,            // timer index
    .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
};
#endif
#if CONFIG_USE_KY006
static ledc_timer_config_t ledc_timer_buzzer = {
    .duty_resolution = BUZZER_RESOLUTION, // resolution of PWM duty : 0..8191
    .freq_hz = BUZZER_START_FREQ,                      // frequency of PWM signal : 20ms
    .speed_mode = BUZZER_SPEED_MODE,           // timer mode
    .timer_num = BUZZER_LEDC_TIMER,            // timer index
    .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
};
#endif
#if CONFIG_USE_KY029
static ledc_timer_config_t ledc_timer_ky029 = {
    .duty_resolution = KY029_RESOLUTION, // resolution of PWM duty : 0..8191
    .freq_hz = KY029_FREQ,                      // frequency of PWM signal : 20ms
    .speed_mode = KY029_SPEED_MODE,           // timer mode
    .timer_num = KY029_LEDC_TIMER,            // timer index
    .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
};
#endif
#if CONFIG_USE_KY009
static ledc_timer_config_t ledc_timer_ky009 = {
    .duty_resolution = KY009_RESOLUTION, // resolution of PWM duty : 0..8191
    .freq_hz = KY009_FREQ,                      // frequency of PWM signal : 20ms
    .speed_mode = KY009_SPEED_MODE,           // timer mode
    .timer_num = KY009_LEDC_TIMER,            // timer index
    .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
};
#endif

// 1. Détermination des canaux pour le BTS7960 (2 canaux si activé, 0 sinon)
#if CONFIG_USE_BTS7960
    #define BTS7960_CHANNELS 2
#else
    #define BTS7960_CHANNELS 0
#endif

// 2. Détermination pour le KY006 (1 canal si activé, 0 sinon)
#if CONFIG_USE_KY006
    #define KY006_CHANNELS 1
#else
    #define KY006_CHANNELS 0
#endif

// 3. Détermination pour le MG996R (1 canal si activé, 0 sinon)
#if CONFIG_USE_MG996R
    #define MG996R_CHANNELS 1
#else
    #define MG996R_CHANNELS 0
#endif

