FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
#if CONFIG_USE_KY029
    #define KY029_CHANNELS 2
#else
    #define KY029_CHANNELS 0
#endif

#if CONFIG_USE_KY009
    #define KY009_CHANNELS 3
#else
    #define KY009_CHANNELS 0
#endif

// Somme totale sécurisée
#define LEDC_CHANNELS_COUNT (BTS7960_CHANNELS + KY006_CHANNELS + MG996R_CHANNELS + KY029_CHANNELS + KY009_CHANNELS)

//idx for channels
#if CONFIG_USE_BTS7960
#define MOTOR_IDX_FWD  0
#define MOTOR_IDX_BWD  1
#endif
#if CONFIG_USE_MG996R
#define DIRECTION_IDX  BTS7960_CHANNELS
#endif
#if CONFIG_USE_KY006
#define BUZZER_IDX     BTS7960_CHANNELS + MG996R_CHANNELS
#endif
#if CONFIG_USE_KY029
#define KY029_RED_IDX     BTS7960_CHANNELS + MG996R_CHANNELS + KY006_CHANNELS
#define KY029_GREEN_IDX     BTS7960_CHANNELS + MG996R_CHANNELS + KY006_CHANNELS + 1
#endif
#if CONFIG_USE_KY009
#define KY009_RED_IDX     BTS7960_CHANNELS + MG996R_CHANNELS + KY006_CHANNELS
#define KY009_GREEN_IDX     BTS7960_CHANNELS + MG996R_CHANNELS + KY006_CHANNELS + 1
#define KY009_BLUE_IDX     BTS7960_CHANNELS + MG996R_CHANNELS + KY006_CHANNELS + 2
#endif

/*
* Prepare individual configuration
* for each channel of LED Controller
* by selecting:
* - controller's channel number
* - output duty cycle, set initially to 0
* - GPIO number where LED is connected to
* - speed mode, either high or low
* - timer servicing selected channel
*   Note: if different channels use one timer,
*         then frequency and bit_num of these channels
*         will be the same
*/
static ledc_channel_config_t ledc_channel[LEDC_CHANNELS_COUNT] = {
#if CONFIG_USE_BTS7960
    {
        .channel    = BTS_CHANNEL_FWD,
        .duty       = 0,
        .gpio_num   = BTS_GPIO_FWD,
        .speed_mode = BTS_SPEED_MODE,
        .hpoint     = 0,
        .timer_sel  = BTS_TIMER,
        .flags.output_invert = 0
    },
    {
        .channel    = BTS_CHANNEL_BWD,
        .duty       = 0,
        .gpio_num   = BTS_GPIO_BWD,
        .speed_mode = BTS_SPEED_MODE,
        .hpoint     = 0,
        .timer_sel  = BTS_TIMER,
        .flags.output_invert = 0
    },
#endif
#if CONFIG_USE_MG996R
    {
        .channel    = MG_CHANNEL,
        .duty       = 0,
        .gpio_num   = MG_GPIO,
        .speed_mode = MG_SPEED_MODE,
        .hpoint     = 0,
        .timer_sel  = MG_TIMER,
        .flags.output_invert = 0
    },
#endif
#if CONFIG_USE_KY006
    {
        .channel             = BUZZER_LEDC_CHANNEL,     
        .duty                = 0,                   
        .gpio_num            = BUZZER_GPIO,         
        .speed_mode          = BUZZER_SPEED_MODE, 
        .hpoint              = 0,
        .timer_sel           = BUZZER_LEDC_TIMER,     
        .flags.output_invert = 0
    },
#endif
#if CONFIG_USE_KY029
    {
        .channel             = KY029_RED_CHANNEL,     
        .duty                = 0,                   
        .gpio_num            = KY029_RED_GPIO,         
        .speed_mode          = KY029_SPEED_MODE, 
        .hpoint              = 0,
        .timer_sel           = KY029_LEDC_TIMER,     
        .flags.output_invert = 0
    },
    {
        .channel             = KY029_GREEN_CHANNEL,     
        .duty                = 0,                   
        .gpio_num            = KY029_GREEN_GPIO,         
        .speed_mode          = KY029_SPEED_MODE, 
        .hpoint              = 0,
        .timer_sel           = KY029_LEDC_TIMER,     
        .flags.output_invert = 0
    },
#endif
#if CONFIG_USE_KY009
    {
        .channel             = KY009_RED_CHANNEL,     
        .duty                = 0,                   
        .gpio_num            = KY009_RED_GPIO,         
        .speed_mode          = KY009_SPEED_MODE, 
        .hpoint              = 0,
        .timer_sel           = KY009_LEDC_TIMER,     
        .flags.output_invert = 0
    },
    {
        .channel             = KY009_GREEN_CHANNEL,     
        .duty                = 0,                   
        .gpio_num            = KY009_GREEN_GPIO,         
        .speed_mode          = KY009_SPEED_MODE, 
        .hpoint              = 0,
        .timer_sel           = KY009_LEDC_TIMER,     
        .flags.output_invert = 0
    },
    {
        .channel             = KY009_BLUE_CHANNEL,     
        .duty                = 0,                   
        .gpio_num            = KY009_BLUE_GPIO,         
        .speed_mode          = KY009_SPEED_MODE, 
        .hpoint              = 0,
        .timer_sel           = KY009_LEDC_TIMER,     
        .flags.output_invert = 0
    },
#endif
};

//semaphore for fade events
static SemaphoreHandle_t counting_sem = NULL;

#if CONFIG_DEBUG_LEDC
static char * mode_str(const ledc_mode_t mode) {
    switch (mode)
    {
    case LEDC_HIGH_SPEED_MODE:
        return "High speed";
    case LEDC_LOW_SPEED_MODE:
        return "Low speed";
    case LEDC_SPEED_MODE_MAX:
        return "Max speed";
    default:
        return "Unknown";
    }
}

static char * itr_str(const ledc_intr_type_t type) {
    switch (type)
    {
    case LEDC_INTR_DISABLE:
        return "Disabled";
    case LEDC_INTR_FADE_END:
        return "Enabled";
    case LEDC_INTR_MAX:
        return "Max";
    default:
        return "Unknown";
    }
}

static char * sleep_str(const ledc_sleep_mode_t sleep) {
    switch (sleep)
    {
    case LEDC_SLEEP_MODE_NO_ALIVE_NO_PD:
        return "No alive, no PD";
    case LEDC_SLEEP_MODE_NO_ALIVE_ALLOW_PD:
        return "No alive, allow PD";
    case LEDC_SLEEP_MODE_KEEP_ALIVE:
        return "Keep alive";
    case LEDC_SLEEP_MODE_INVALID:
        return "Invalid";
    default:
        return "Unknown";
    }
}

static char * clock_str(const ledc_clk_cfg_t clock) {
    switch (clock)
    {
    case LEDC_AUTO_CLK: 
        return "AUTO";
    case LEDC_USE_APB_CLK: //80MHz
        return "APB";
    case LEDC_USE_RC_FAST_CLK: //~8MHz (Low speed only)
        return "RC_FAST";
    case LEDC_USE_REF_TICK: //1MHz
        return "REF_TICK";
    default:
        return "Unknown";
    }
}

static char * event_str(const ledc_cb_event_t event) {
    switch (event)
    {
    case LEDC_FADE_END_EVT:
        return "Fade end";
    default:
        return "Unknown";
    }
}

