FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
#define MOTOR_CTRL_PERIOD 20000

typedef enum { 
    CURVE_LINEAR = 0, 
    CURVE_EXP = 1, 
    CURVE_COSINE = 2 
} CurveType;

#define MOTOR_FRAME_SIZE 7

typedef struct {
    uint8_t curve_type;
    uint8_t accel_param;   // 0-255, sens dépend du curve_type
    uint8_t decel_param;   // idem, séparé (asymétrie accel/frein)
} DriveProfileConfig;

void serialize_motor(DriveProfileConfig *cfg, uint8_t* buf) {
    buf[0] = cfg->curve_type;
    buf[1] = cfg->accel_param;
    buf[2] = cfg->decel_param;
    int16_t curr = current_motor;
    int16_t targ = target_motor;
    memcpy(&buf[3], &curr, sizeof(int16_t));
    memcpy(&buf[5], &targ, sizeof(int16_t));
}

static DriveProfileConfig cfg = { CURVE_LINEAR, 5, 150 };
static int32_t ramp_start_motor = 0;
static uint32_t ramp_tick = 0;

static int32_t apply_curve_step(int32_t current, int32_t target, uint8_t param, uint8_t curve_type) {
    int32_t delta = target - current;
    if (delta == 0) return current;

    switch (curve_type) {
        case CURVE_LINEAR: {
            int32_t step = (delta > 0) ? param : -param;
            int32_t next = current + step;
            return (delta > 0) ? (next > target ? target : next) : (next < target ? target : next);
        }
        case CURVE_EXP: {
            float alpha = param / 255.0f;
            return current + (int32_t)(delta * alpha);
        }
        case CURVE_COSINE: {
            ramp_tick++;
            uint32_t total_ticks = 200 - param; // param haut = rampe courte/nerveuse
            if (total_ticks < 1) total_ticks = 1;
            float t = (float)ramp_tick / total_ticks;
            if (t > 1.0f) t = 1.0f;
            float s = (1.0f - cosf(M_PI * t)) / 2.0f;
            return ramp_start_motor + (int32_t)((target - ramp_start_motor) * s);
        }
    }
    return current;
}

static void apply_target_motor(void* args) { 

    if (current_motor != target_motor) {

        bool is_accel = (target_motor > current_motor && current_motor >= 0) ||
            (target_motor < current_motor && current_motor <= 0);
        if (current_motor == ramp_start_motor && ramp_tick == 0) ramp_start_motor = current_motor; // reset si nouveau ramp

        current_motor = apply_curve_step(current_motor, target_motor,
            is_accel ? cfg.accel_param : cfg.decel_param, cfg.curve_type);

        //applying duty forward et 0 backward
        if (current_motor > 0) {
            ledc_duty(
                MIN_MOTOR_DUTY_FWD + ((MAX_MOTOR_DUTY_FWD - MIN_MOTOR_DUTY_FWD) * current_motor) / 1000, MOTOR_IDX_FWD
            );
            ledc_duty(0, MOTOR_IDX_BWD);
        }

        //applying duty backward et 0 forward
        else if (current_motor < 0) {
            ledc_duty(
                MIN_MOTOR_DUTY_BWD + ((MAX_MOTOR_DUTY_BWD - MIN_MOTOR_DUTY_BWD) * - current_motor) / 1000, MOTOR_IDX_BWD
            );
            ledc_duty(0, MOTOR_IDX_FWD);
        }

        //applying 0 to backward & forward
        else {
            ledc_duty(0, MOTOR_IDX_FWD);
            ledc_duty(0, MOTOR_IDX_BWD);
        }

    #if CONFIG_USE_UDPLIB && CONFIG_USE_SENSORS
        header_sensor_t header = {0};
        header.esp_id = (uint8_t)CONFIG_ESP_ID;
        header.timestamp = (uint32_t)(esp_timer_get_time() / 1000);
        header.type = SENSOR_TYPE_MOTOR;
        uint8_t buf[HEADER_SENSOR_SIZE + MOTOR_FRAME_SIZE];
        serialize_header(&header, buf);
        serialize_motor(&cfg, &buf[HEADER_SENSOR_SIZE]);
        send_udp_sensor(buf, sizeof(buf));
    #endif
        
        log_msg(TAG, "Motor : %d/%d, on pins; fwd : %d, bwd : %d",
            current_motor, target_motor, BTS_GPIO_FWD, BTS_GPIO_BWD);

        #if CONFIG_WRITE_MOTOR_SCREEN

#if USE_LVGL_SCREEN
        set_bar_motor(current_motor);
#else
        //print to screen
        char tmp[30];
        snprintf(tmp, sizeof(tmp), "Motor : %d, Target: %d", current_motor, target_motor);
        ssd1306_draw_string(tmp, 0, 4);
#endif
#endif
    } else {
        ramp_tick = 0;
        ramp_start_motor = current_motor;
    }
}

#endif

esp_err_t apply_config(uint8_t *buf, uint8_t len) {
    cfg.curve_type = buf[0];
    cfg.accel_param = buf[1];
    cfg.decel_param = buf[2];
    return ESP_OK;
}

/**
 * Initalize led
 * -Initialize mutex
 * -Reset pin
 * -Set output mode
 * -Load previous state in nvs and apply it
 */
void led_init() {
#if CONFIG_USE_BUILTIN_LED
    if( xMutex != NULL )
    {
        log_msg(TAG, "Mutex already initialized");
        return;
    }

    xMutex = xSemaphoreCreateMutex();

    if( xMutex == NULL )
    {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    //reset gpio pin
    esp_err_t err = gpio_reset_pin(LED_PIN);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) resetting pin %d", esp_err_to_name(err), LED_PIN);
        return;
    }

    //set output mode for gpio
    err = gpio_set_direction(LED_PIN, GPIO_MODE_OUTPUT);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting direction pin %d", esp_err_to_name(err), LED_PIN);
        return;
    }
#if CONFIG_SAVE_LED
    //load led state in nvs and apply it to gpio
    err = load_nvs_int("led_state", &led_state);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) loading nvs int : led_state", esp_err_to_name(err));
        return;
    }
#endif
    err = gpio_set_level(LED_PIN, led_state);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
        return;
    }

    log_msg(TAG, "Led initialized on pin %d", LED_PIN);
#endif

}

/**
 * Led on : set level of gpio to HIGH and save it to nvs
 */
void led_on() {

#if CONFIG_USE_BUILTIN_LED
    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        if (led_state == 0) {
            led_state = 1;
            esp_err_t err = gpio_set_level(LED_PIN, led_state);
            if (err != ESP_OK) {
                log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
                xSemaphoreGive(xMutex);
                return;
            }
        #if CONFIG_SAVE_LED
            err = save_nvs_int("led_state", led_state);
            if (err != ESP_OK) {
                log_msg_lvl(ESP_LOG_ERROR, TAG, "Error (%s) loading saving led_state in nvs", esp_err_to_name(err));
                xSemaphoreGive(xMutex);
                return;
            }
        #endif
            log_msg(TAG, "Led on");
        }
        xSemaphoreGive(xMutex);
    }
#endif
}

/**
 * Led off : set level of gpio to LOW and save it to nvs
 */
void led_off() {
#if CONFIG_USE_BUILTIN_LED
    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        if (led_state != 0) {
            led_state = 0;
            esp_err_t err = gpio_set_level(LED_PIN, led_state);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
                xSemaphoreGive(xMutex);
                return;
            }
    #if CONFIG_SAVE_LED
            err = save_nvs_int("led_state", led_state);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) loading saving led_state in nvs", esp_err_to_name(err));
                xSemaphoreGive(xMutex);
                return;
            }
    #endif
            log_msg(TAG, "Led off");
        }
        xSemaphoreGive(xMutex);
    }
#endif
}

/**
 * Led toggle : reverse level and save it to nvs
 */
void led_toggle() {
#if CONFIG_USE_BUILTIN_LED
    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        led_state = !led_state;
        esp_err_t err = gpio_set_level(LED_PIN, led_state);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) setting level on pin : %d", esp_err_to_name(err), LED_PIN);
            xSemaphoreGive(xMutex);
            return;
        }
    #if CONFIG_SAVE_LED
        err = save_nvs_int("led_state", led_state);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) loading saving led_state in nvs", esp_err_to_name(err));
            xSemaphoreGive(xMutex);
            return;
        }
    #endif
        log_msg(TAG, "Led toggled to : %d", led_state);
        xSemaphoreGive(xMutex);
    }
#endif
}

/**
 * Close led
 * -Stop ledc channels, fade, timers
 * -Destroy mutex
 */
void close_led() {
#if CONFIG_USE_BUILTIN_LED
    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return;
    }
#endif

    //destroy ledc
    esp_err_t err;
    for (int i = 0; i < LEDC_CHANNELS_COUNT; i++) {
        //idle level to 0 = LOW?
        err = ledc_stop(ledc_channel[i].speed_mode, ledc_channel[i].channel, 0);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) on stop ledc channel %d", esp_err_to_name(err), i);
        }
    }
    ledc_fade_func_uninstall();

#if CONFIG_USE_BTS7960
    err = ledc_timer_rst(ledc_timer_bts.speed_mode, ledc_timer_bts.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on reset ledc timer BTS", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_MG996R
    err = ledc_timer_rst(ledc_timer_mg.speed_mode, ledc_timer_mg.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on reset ledc timer MG", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_KY006
    err = ledc_timer_rst(ledc_timer_buzzer.speed_mode, ledc_timer_buzzer.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on reset ledc timer buzzer", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_KY029
    err = ledc_timer_rst(ledc_timer_ky029.speed_mode, ledc_timer_ky029.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on reset ledc timer ky029", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_KY009
    err = ledc_timer_rst(ledc_timer_ky009.speed_mode, ledc_timer_ky009.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on reset ledc timer ky029", esp_err_to_name(err));
    }
#endif

#if CONFIG_USE_BTS7960
    err = ledc_timer_pause(ledc_timer_bts.speed_mode, ledc_timer_bts.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on pause ledc timer BTS", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_MG996R
    err = ledc_timer_pause(ledc_timer_mg.speed_mode, ledc_timer_mg.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on pause ledc timer MG", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_KY006
    err = ledc_timer_pause(ledc_timer_buzzer.speed_mode, ledc_timer_buzzer.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on pause ledc timer buzzer", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_KY029
    err = ledc_timer_pause(ledc_timer_ky029.speed_mode, ledc_timer_ky029.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on pause ledc timer ky029", esp_err_to_name(err));
    }
#endif
#if CONFIG_USE_KY009
    err = ledc_timer_pause(ledc_timer_ky009.speed_mode, ledc_timer_ky009.timer_num);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) on pause ledc timer ky029", esp_err_to_name(err));
    }
#endif

