FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
    if (counting_sem != NULL) {
        vSemaphoreDelete(counting_sem);
        counting_sem = NULL;
    }

#if CONFIG_USE_BUILTIN_LED
    vSemaphoreDelete(xMutex);
    xMutex = NULL;
#endif

    log_msg(TAG, "Led & Ledc closed");
}

/**
 * Get led state
 * @return int current led state, -1 if error
 */
int get_led_state() {

    int led = -1;
#if CONFIG_USE_BUILTIN_LED
    if (xMutex == NULL) {
        log_msg(TAG, "Error on mutex creation");
        return led;
    }

    if (xSemaphoreTake(xMutex, portMAX_DELAY) == pdTRUE) {
        led = led_state;
        xSemaphoreGive(xMutex);
    }
#endif
    return led;
}

/**
 * Init ledc
 * -Init timers, channels, fade, count semaphore & register fade callback
 */
void init_ledc() {

    esp_err_t err;
    int ch;

    // Set configuration of timer bts & mg for high speed channels
#if CONFIG_USE_BTS7960
    err = ledc_timer_config(&ledc_timer_bts);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting timer for BTS", esp_err_to_name(err));
        return;
    }
#endif

#if CONFIG_USE_MG996R
    err = ledc_timer_config(&ledc_timer_mg);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting timer for MG", esp_err_to_name(err));
        return;
    }
#endif

#if CONFIG_USE_KY006
    err = ledc_timer_config(&ledc_timer_buzzer);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting timer for buzzer", esp_err_to_name(err));
        return;
    }
#endif
#if CONFIG_USE_KY029
    err = ledc_timer_config(&ledc_timer_ky029);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting timer for KY-029", esp_err_to_name(err));
        return;
    }
#endif
#if CONFIG_USE_KY009
    err = ledc_timer_config(&ledc_timer_ky009);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting timer for KY-009", esp_err_to_name(err));
        return;
    }
#endif

    // Set LED Controller with previously prepared configuration
    for (ch = 0; ch < LEDC_CHANNELS_COUNT; ch++) {
        err = ledc_channel_config(&ledc_channel[ch]);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) setting channel %d",
                esp_err_to_name(err), ch);
            return;
        }
    }

    // Initialize fade service.
    err = ledc_fade_func_install(0);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) installing fade", esp_err_to_name(err));
        return;
    }
    ledc_cbs_t callbacks = {
        .fade_cb = cb_ledc_fade_end_event
    };
    counting_sem = xSemaphoreCreateCounting(LEDC_CHANNELS_COUNT, 0);
    if (counting_sem == NULL) {
        log_msg(TAG, "Error creating ledc semaphore");
        return;
    }


    for (ch = 0; ch < LEDC_CHANNELS_COUNT; ch++) {
        err = ledc_cb_register(ledc_channel[ch].speed_mode, ledc_channel[ch].channel, &callbacks, (void *) counting_sem);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) registering callback on channel %d", esp_err_to_name(err), ch);
            return;
        }
    }

#if CONFIG_USE_BTS7960
    log_msg(TAG, "Setting up control timer");
    const esp_timer_create_args_t ctrl_timer_args = {
        .callback = &apply_target_motor,
        .name = "ctrl_timer"
    };
    esp_timer_handle_t ctrl_timer = NULL;
    err = esp_timer_create(&ctrl_timer_args, &ctrl_timer);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "failed to create  control esp timer instance");
        return;
    }
    err = esp_timer_start_periodic(ctrl_timer, MOTOR_CTRL_PERIOD);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "failed to start periodic timer");
        return;
    }
#endif

    log_msg(TAG, "LEDC initialized");

#if CONFIG_DEBUG_LEDC || CONFIG_DEBUG_GPIO
    print_esp_info_ledc();
#endif
}

void init_all_gpios() {

    led_init();
    init_ledc();

    #if CONFIG_USE_BUILTIN_LED_W2812B
    init_ws2812_rmt();
    #endif
}

/**
 * Apply fade duty
 * -Set & start fade, and then the ISR callback will be called
 */
void ledc_duty_fade(const uint32_t duty, const uint8_t idx) {

    esp_err_t err;

    if (idx > LEDC_CHANNELS_COUNT) {
        log_msg(TAG, "Out of bounds");
        return;
    }

    err = ledc_set_fade_with_time(ledc_channel[idx].speed_mode,
                                ledc_channel[idx].channel, duty, LEDC_TEST_FADE_TIME);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) setting fade duty %d on channel %d",
            esp_err_to_name(err), duty, idx);
        return;
    }

    
    ledc_fade_mode_t fade_mode = LEDC_FADE_NO_WAIT; //non blocking
    /*ledc_fade_mode_t fade_mode = LEDC_FADE_WAIT_DONE; //blocking */
    err = ledc_fade_start(ledc_channel[idx].speed_mode,
                    ledc_channel[idx].channel, fade_mode);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) starting fade duty %d on channel %d",
            esp_err_to_name(err), duty, idx);
        return;
    }

    log_msg(TAG, "Starting fade : %d, on channel %d", duty, idx);
    xSemaphoreTake(counting_sem, portMAX_DELAY);
}



/**
 * Get current angle of servo
 */
esp_err_t get_servo_angle(uint8_t* angle) {
#if CONFIG_USE_MG996R
    *angle = current_angle;
    return ESP_OK;
#else
    return ESP_FAIL;
#endif
}

/**
 * Get current angle of servo
 */
esp_err_t get_motor_percent(int16_t* motor) {
#if CONFIG_USE_BTS7960
    *motor = current_motor;
    return ESP_OK;
#else
    return ESP_FAIL;
#endif
}

esp_err_t set_motor_percent(int16_t motor) {
#if CONFIG_USE_BTS7960
    target_motor = motor;
    return ESP_OK;
#else
    return ESP_FAIL;
#endif
}

/**
 * Apply a ledc angle for MG servo
 * -Clamp value, check if the value changed, transform angle to duty & apply it
 * -Write to screen if set
 */
void ledc_angle(int16_t angle) {
#if CONFIG_USE_MG996R
    //clamp
    if (angle < 0) angle = 0;
    if (angle > 180) angle = 180;

    if (current_angle != angle) {
        current_angle = angle;

        //applying duty
        ledc_duty(
            MIN_SERVO_DUTY + ((MAX_SERVO_DUTY - MIN_SERVO_DUTY) * angle) / 180, DIRECTION_IDX
        );

        log_msg(TAG, "Angle : %d, on pin %d", angle, MG_GPIO);

#if CONFIG_WRITE_ANGLE_SCREEN

#if USE_LVGL_SCREEN
        set_bar_steer((current_angle - 90) * 200 / 180);
#else
        //print to screen
        char tmp[30];
        snprintf(tmp, sizeof(tmp), "Angle : %d", current_angle);
        ssd1306_draw_string(tmp, 0, 2);
#endif
#endif
    }
#endif
    
