FireVirtuozz/ESP32/server/components/ledLib/ledLib.c
}

esp_err_t force_motor_stop() {
#if CONFIG_USE_BTS7960
    target_motor = 0;
    current_motor = 0;
    ledc_duty(0, MOTOR_IDX_FWD);
    ledc_duty(0, MOTOR_IDX_BWD);
    return ESP_OK;
#else
    return ESP_FAIL;
#endif

}



/**
 * Apply a ledc motor for BTS
 * -Clamp value, check if the value changed, transform motor to duty & apply it
 * -Write to screen if set
 */
void ledc_motor(int16_t motor_percent) {
#if CONFIG_USE_BTS7960
    //clamp
    if (motor_percent < -100) motor_percent = -100;
    if (motor_percent > 100) motor_percent = 100; 

    //deadzone
    if (abs(motor_percent) < DEADZONE_MOTOR) {
        motor_percent = 0;
    }

    target_motor = -motor_percent;
#endif
    
}


void ledc_buzzer(int16_t buzzer_percent) {

    #if CONFIG_USE_KY006
    //clamp
    if (buzzer_percent < 0) buzzer_percent = 0;
    if (buzzer_percent > 100) buzzer_percent = 100; 

    ledc_duty(
            BUZZER_MIN_DUTY + ((BUZZER_MAX_DUTY - BUZZER_MIN_DUTY) * buzzer_percent) / 100, BUZZER_IDX
        );
    
    ESP_LOGI(TAG, "apply duty %u", BUZZER_MIN_DUTY + ((BUZZER_MAX_DUTY - BUZZER_MIN_DUTY) * buzzer_percent) / 100);
    #endif
    
}

void ledc_ky029(int16_t ky029_percent, const bool red) {

    #if CONFIG_USE_KY029
    //clamp
    if (ky029_percent < 0) ky029_percent = 0;
    if (ky029_percent > 100) ky029_percent = 100; 

    ledc_duty(
            KY029_MIN_DUTY + ((KY029_MAX_DUTY - KY029_MIN_DUTY) * ky029_percent) / 100, 
            red ? KY029_RED_IDX : KY029_GREEN_IDX
        );
    
    ESP_LOGI(TAG, "apply duty %u", KY029_MIN_DUTY + ((KY029_MAX_DUTY - KY029_MIN_DUTY) * ky029_percent) / 100);
    #endif
    
}

void ledc_ky009(int16_t ky009_percent, const uint8_t color) {

    #if CONFIG_USE_KY009
    //clamp
    if (ky009_percent < 0) ky009_percent = 0;
    if (ky009_percent > 100) ky009_percent = 100; 

    int8_t idx = -1;
    switch (color)
    {
    case 0:
        idx = KY009_RED_IDX;
        break;
    case 1:
        idx = KY009_GREEN_IDX;
        break;
    case 2:
        idx = KY009_BLUE_IDX;
        break;
    
    default:
        break;
    }

    if (idx != -1) {
        ledc_duty(
            KY009_MIN_DUTY + ((KY009_MAX_DUTY - KY009_MIN_DUTY) * ky009_percent) / 100, 
            idx
        );
    
        ESP_LOGI(TAG, "apply duty %u", KY009_MIN_DUTY + ((KY009_MAX_DUTY - KY009_MIN_DUTY) * ky009_percent) / 100);
    }

    #endif
    
}

#if CONFIG_DEBUG_LEDC || CONFIG_DEBUG_GPIO
void print_esp_info_ledc() {

    esp_err_t err;

#if CONFIG_DEBUG_LEDC
    log_msg(TAG, "============= LEDC capabilities =============");

    log_msg(TAG, "LEDC timers        : %d", SOC_LEDC_TIMER_NUM);
    log_msg(TAG, "LEDC channels      : %d", SOC_LEDC_CHANNEL_NUM);
    log_msg(TAG, "Max duty resolution: %d bits", SOC_LEDC_TIMER_BIT_WIDTH);

    //SOC_LEDC_HAS_TIMER_SPECIFIC_MUX;

    #if SOC_LEDC_SUPPORT_HS_MODE
        log_msg(TAG, "High Speed mode    : SUPPORTED");
    #else
        log_msg(TAG, "High Speed mode    : NOT supported (LS only)");
    #endif

    #if SOC_LEDC_SUPPORT_REF_TICK
        log_msg(TAG, "REF_TICK clock     : SUPPORTED (light sleep safe)");
    #else
        log_msg(TAG, "REF_TICK clock     : NOT supported");
    #endif

    #if SOC_LEDC_SUPPORT_APB_CLOCK
        log_msg(TAG, "APB clock (80 MHz) : SUPPORTED");
    #else
        log_msg(TAG, "APB clock (80 MHz) : NOT supported");
    #endif

    uint32_t val;

    int val_int;
    for (int i = 0; i < LEDC_NUM_TEST; i++) {
        print_channel_config(ledc_channel[i]);
        val_int = ledc_get_hpoint(ledc_channel[i].speed_mode, ledc_channel[i].channel);
        log_msg(TAG, "Hpoint channel %d : %d", i, val_int);
        val = ledc_get_duty(ledc_channel[i].speed_mode, ledc_channel[i].channel);
        log_msg(TAG, "Duty channel %d : %d", i, val);
    }

    print_timer_config(ledc_timer_bts);
    print_timer_config(ledc_timer_mg);

    val = ledc_get_freq(ledc_timer_bts.speed_mode, ledc_timer_bts.timer_num);
    log_msg(TAG, "BTS Frequence : %d", val);

    //clock : APB, REF_TICK, RC_FAST
    soc_module_clk_t clock = get_clock_source_by_register(ledc_timer_bts);
    
    //precision : cached, approx, exact, invalid
    //for specific clocks, like RC_FAST 
    esp_clk_tree_src_freq_precision_t precision = ESP_CLK_TREE_SRC_FREQ_PRECISION_EXACT; //exact
    err = esp_clk_tree_src_get_freq_hz(clock, precision, &val);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) getting clock frequency for BTS",
            esp_err_to_name(err));
    }
    log_msg(TAG, "BTS clock frequency : %d", val);

    val = ledc_find_suitable_duty_resolution(val, BTS_FREQ);
    log_msg(TAG, "BTS suitable duty resolution : %d", val);

    val = ledc_get_freq(ledc_timer_mg.speed_mode, ledc_timer_mg.timer_num);
    log_msg(TAG, "MG Frequence : %d", val);

    clock = get_clock_source_by_register(ledc_timer_mg);

    precision = ESP_CLK_TREE_SRC_FREQ_PRECISION_EXACT; //exact
    err = esp_clk_tree_src_get_freq_hz(clock, precision, &val);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) getting clock frequency for MG",
            esp_err_to_name(err));
    }
    log_msg(TAG, "MG clock frequency : %d", val);

    val = ledc_find_suitable_duty_resolution(val, MG_FREQ);
    log_msg(TAG, "MG suitable duty resolution : %d", val);
#endif

#if CONFIG_DEBUG_GPIO
    log_msg(TAG, "============= GPIO capabilities =============");
    log_msg(TAG, "GPIO pin count        : %d", GPIO_PIN_COUNT);

    gpio_io_config_t out_io_config;
    gpio_drive_cap_t drive_cap;
    for (int i = 0; i < GPIO_PIN_COUNT; i++) {
        err = gpio_get_io_config(i, &out_io_config);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) getting GPIO config for pin %d",
                esp_err_to_name(err), i);
        }
        log_msg(TAG, "GPIO pin %d; valid : %d, valid output: %d, valid pad : %d",
            i, GPIO_IS_VALID_GPIO(i), GPIO_IS_VALID_OUTPUT_GPIO(i), GPIO_IS_VALID_DIGITAL_IO_PAD(i));
        ;
        log_msg(TAG, "Reserved : %s", esp_gpio_is_reserved(BIT64(i)) ? "Yes" : "No");
        print_gpio_config(out_io_config);
        log_msg(TAG, "Level : %d", gpio_get_level(i));
        err = gpio_get_drive_capability(i, &drive_cap);
        if (err != ESP_OK) {
            log_msg(TAG, "Error (%s) getting GPIO drive capability for pin %d",
                esp_err_to_name(err), i);
        }
        log_msg(TAG, "Strength : %s", drive_cap_str(drive_cap));
    }
#endif

    log_msg(TAG, "=============================================");
}
#endif

void dump_gpio_stats() {
#if CONFIG_DEBUG_GPIO
    gpio_dump_io_configuration(stdout, SOC_GPIO_VALID_GPIO_MASK);
#endif
}

/*
==========================
other functions for ledc
==========================
*/

//ledc_set_pin to configure channel config better
//ledc_set_freq

//ledc_set_duty_and_update
//ledc_set_duty_with_hpoint;

//ledc_set_fade
//ledc_set_fade_with_step
//ledc_set_fade_step_and_start
//ledc_set_fade_time_and_start

//ledc_isr_register (deprecated)

//ledc_timer_resume
//ledc_bind_channel_timer (deprecated)

/*
==========================
other functions for gpio
==========================
*/

//TODO : change gpio_reset to gpio_config to control everything

/*for interruptions rising / falling edges, in input mode*/
//gpio_set_intr_type
//gpio_intr_enable
//gpio_intr_disable
//gpio_isr_register
//gpio_install_isr_service
//gpio_uninstall_isr_service
//gpio_isr_handler_add
//gpio_isr_handler_remove

/*for gpio config*/
//gpio_config
//gpio_input_enable
//gpio_set_pull_mode
//gpio_wakeup_enable
//gpio_wakeup_disable
//gpio_pullup_en
//gpio_pullup_dis
//gpio_pulldown_en
//gpio_pulldown_dis
//gpio_output_enable
//gpio_output_disable
//gpio_od_enable
//gpio_od_disable
//gpio_set_drive_capability
//gpio_hold_en
//gpio_hold_dis
//gpio_deep_sleep_hold_en
//gpio_deep_sleep_hold_dis
//gpio_sleep_sel_en
//gpio_sleep_sel_dis
//gpio_sleep_set_direction
//gpio_sleep_set_pull_mode

//rtc gpios : for sleep-active gpios
